#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>

```
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.stock_messaging_policy will be created
  + resource "aws_iam_policy" "stock_messaging_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allows Stock API to publish and consume from SQS"
      + id               = (known after apply)
      + name             = "StockMessagingPolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "sqs:SendMessage",
                          + "sqs:ReceiveMessage",
                          + "sqs:DeleteMessage",
                          + "sqs:GetQueueAttributes",
                          + "sqs:GetQueueUrl",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:sqs:us-east-1:258531703731:stock-add-event",
                          + "arn:aws:sqs:us-east-1:258531703731:stock-remove-event",
                          + "arn:aws:sqs:us-east-1:258531703731:os-status-update-event",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role_policy_attachment.stock_irsa_messaging will be created
  + resource "aws_iam_role_policy_attachment" "stock_irsa_messaging" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "stock-api-irsa"
    }

  # module.stock_irsa_role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-1.amazonaws.com/id/24087C053FE2BA012E7F4E029625ADB2:aud" = "sts.amazonaws.com"
                              + "oidc.eks.us-east-1.amazonaws.com/id/24087C053FE2BA012E7F4E029625ADB2:sub" = "system:serviceaccount:default:stock-sa"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::258531703731:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/24087C053FE2BA012E7F4E029625ADB2"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "stock-api-irsa"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "Project"     = "techchallenge-stock"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "Project"     = "techchallenge-stock"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>
*Pusher: @viniciusrsfilho, Action: `pull_request`*